namespace Durak.Common.Cards
{
    // Перелік рангів карт
    public enum CardRank : byte
    {
        // Ранг карти - шість
        Six = 6,
        // Ранг карти - сім
        Seven = 7,
        // Ранг карти - вісім
        Eight = 8,
        // Ранг карти - дев'ять
        Nine = 9,
        // Ранг карти - десять
        Ten = 10,
        // Ранг карти - валет
        Jack = 11,
        // Ранг карти - дама
        Queen = 12,
        // Ранг карти - король
        King = 13,
        // Ранг карти - туз
        Ace = 14,
    }
}
