using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Durak.Common
{
    // Представляє тип для певного повідомлення
    public enum MessageType
    {
        // Відправляється запит на початок гри      
        StartGame = 31,
        // Відправляється запит на додавання бота
        AddBot = 32,
        // Відправляється запит на видалення бота
        KickBot = 33,
        // Відправляється запит на налаштування ботів на сервері (default = 0.5)
        BotSettings = 34,
        // Відправляється сервером для повідомлення, що параметр гри змінився
        GameStateChanged = 50,
        // Відправляється передача всього стану гри клієнту
        FullGameState = 51,
        // Відправляється клієнтом для запиту стану гри
        RequestServerState = 60,
        // Відправляється сервером для повідомлення клієнту, що сервер перебуває в недійсному стані для запиту, який він зробив
        InvalidServerState = 61,
        // Відправляється повідомлення, що змінився стан сервера
        NotifyServerStateChanged = 62,
        // Відправляється клієнтом для запиту встановлення параметра стану на певне значення
        RequestState = 63,
        // Гравець приєднався
        PlayerJoined = 130,
        // Бота вигнано
        BotKicked = 131,
        // Відправляється сервером для сповіщення клієнтів, що гра готова.
        GameReady = 132,
        // Інформація гравця
        PlayerConnectInfo = 134,
        // Відправляється сервером клієнту, коли його карти в руці змінились
        PlayerHandChanged = 140,
        // Відправляється сервером всім клієнтам, коли змінилась кількість карт іншого гравця
        CardCountChanged = 141,
        // Відправляється запиту про зіграний хід
        SendMove = 150,
        // Відправляється сервером для сповіщення клієнта, що його запитаний хід є недійсним
        InvalidMove = 151,
        // Відправляється сервером для сповіщення клієнтів про те, що гравець зробив хід
        SucessfullMove = 152,
        // Відправляється клієнтами та сервером для повідомлення в чаті
        LogChat = 200,
        // Повідомляє господара гри, що він не може розпочати гру
        CannotStart = 201
    }
}
